[
    {
        "id": 1,
        "author": "MD SHAFIQUL ISLAM",
        "author_img": "../img/author/shafiqul.jpg",
        "category": ["Docker"],
        "image": "./img/blog_1/thumbnail.webp",
        "title": "Protect Sensitive Information in Docker: Accessing .env Credentials Without Exposing Them",
        "date": "3 Dec 2024",
        "description": "Managing sensitive information like API keys and credentials is crucial in modern application development. While Docker simplifies containerization, mishandling .env files can expose secrets and compromise security. This blog will guide you through securely managing .env files in Docker, preventing them from being embedded in images, and dynamically injecting credentials at runtime. By following these steps, you’ll ensure your applications remain secure and production-ready.",
        "readMoreUrl": "./blogs/blog_1.html"
    },
    {
        "id": 2,
        "author": "MD SHAFIQUL ISLAM",
        "author_img": "../img/author/shafiqul.jpg",
        "category": ["Git"],
        "image": "./img/blog_2/thumbnail.webp",
        "title": "How to Generate an SSH Key and Add It to GitHub for Secure Git Operations",
        "date": "24 Feb 2025",
        "description": "GitHub requires authentication for performing Git operations like cloning, pushing, and pulling repositories. While passwords were previously used, GitHub now recommends SSH keys for secure and seamless authentication. In this guide, you'll learn how to generate an SSH key, add it to GitHub, and configure your system to authenticate using SSH. By the end, you'll be able to securely interact with your GitHub repositories without entering credentials repeatedly.",
        "readMoreUrl": "./blogs/blog_2.html"
    },
    {
        "id": 3,
        "author": "MD SHAFIQUL ISLAM",
        "author_img": "../img/author/shafiqul.jpg",
        "category": ["Agent"],
        "image": "./img/blog_3/thumbnail.webp",
        "title": "Create ReAct AI Agent from Scratch using Python Without any Framework: A Step-by-Step Guide",
        "date": "15 Mar 2025",
        "description": "Artificial Intelligence (AI) agents are transforming the way we interact with technology. From chatbots to research assistants, these agents automate tasks, answer questions, and even make decisions. Among them, ReAct AI Agents stand out because they think, act, and refine their responses dynamically, making them far more effective than traditional AI models.",
        "readMoreUrl": "./blogs/blog_3.html"
    },
    {
        "id": 4,
        "author": "MD SHAFIQUL ISLAM",
        "author_img": "../img/author/shafiqul.jpg",
        "category": ["Hugging Face", "Streamlit"],
        "image": "./img/blog_4/thumbnail.png",
        "title": "Deploy Streamlit App to Hugging Face Spaces - A Complete Guide",
        "date": "24 May 2025",
        "description": "Deploying a machine learning app should be straightforward and accessible. This article demonstrates how to turn a local Streamlit application into a publicly accessible web app using Hugging Face Spaces, without the need for complex infrastructure. It's ideal for showcasing projects, sharing with stakeholders, or building an interactive portfolio.",
        "readMoreUrl": "./blogs/blog_4.html"
    }
    
]
